# RemoveLeaders Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNote..::..RemoveLeaders Method
TextNote Class See Also
---
Removes all leaders currently attached to the text note.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void RemoveLeaders()
```

Visual Basic
---
```text
Public Sub RemoveLeaders
```

Visual C++
---
```text
public:
void RemoveLeaders()
```

# See Also
TextNote Class
Autodesk.Revit.DB Namespace